app/views/type_of_foods/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."type_of_food_id" = ?  [["type_of_food_id", 2]]
---

<% @typeoffood.recipe.each do |recipe| %>