app/views/preferences/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."preference_id" = ?  [["preference_id", 2]]
---

<% @preference.recipe.each do |recipe| %>