app/views/kitchens/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."kitchen_id" = ?  [["kitchen_id", 1]]
---
    <div class="col-md-4">
      <% @kitchen.recipe.each do |recipe| %>