app/controllers/kitchens_controller.rb

  def create
    @kitchen = Kitchen.new(kitchen_params)
    if @kitchen.save
---
INSERT INTO "kitchens" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ferwwerrew"], ["created_at", "2015-11-06 18:35:31.264381"], ["updated_at", "2015-11-06 18:35:31.264381"]]

  def show
    @kitchen = Kitchen.find(params[:id])
---
SELECT  "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @kitchens = Kitchen.all
---
SELECT "kitchens".* FROM "kitchens"