app/controllers/preferences_controller.rb

  def create
    @preference = Preference.create(preference_params)
---
INSERT INTO "preferences" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fsfdsdff"], ["created_at", "2015-11-06 18:35:57.537359"], ["updated_at", "2015-11-06 18:35:57.537359"]]

  def show
    @preference = Preference.find(params[:id])
---
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", 1]]