app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "kitchen", "kind_of_food", "food_preference", "amount_people", "preparation_time", "difficulty", "ingredients", "preparation", "foto_file_name", "foto_content_type", "foto_file_size", "foto_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save

SELECT  "recipes".* FROM "recipes"  ORDER BY created_at DESC LIMIT 20
SELECT "kitchens".* FROM "kitchens"
SELECT "type_of_foods".* FROM "type_of_foods"
SELECT "preferences".* FROM "preferences"
---
  def index
    @recipes = Recipe.order('created_at DESC').limit(20)
    @kitchens = Kitchen.all
    @typeoffoods = TypeOfFood.all
    @preferences = Preference.all