app/controllers/type_of_foods_controller.rb

INSERT INTO "type_of_foods" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "gdfgfggfd"], ["created_at", "2015-11-06 18:36:33.305607"], ["updated_at", "2015-11-06 18:36:33.305607"]]
---
  def create
    @type_of_food = TypeOfFood.new(typeoffood_params)
    if @type_of_food.save

SELECT  "type_of_foods".* FROM "type_of_foods" WHERE "type_of_foods"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @type_of_food = TypeOfFood.find(params[:id])

SELECT "type_of_foods".* FROM "type_of_foods"
---
  def index
    @type_of_foods = TypeOfFood.all